334 - Non-Profit Website/5k Website/app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)
    if User.first.nil?
      @user.admin = true
    end
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)